const pattern = {
  ตารางการรับประทานอาหาร: [
    {
      วัน: "วันเดือนปีปัจจุบัน",
      มื้อ: "เช้า",
      เมนู: "",
      แคลอรี่: "",
    },
    {
      วัน: "วันเดือนปีปัจจุบัน",
      มื้อ: "กลางวัน",
      เมนู: "",
      แคลอรี่: "",
    },
    {
      วัน: "วันเดือนปีปัจจุบัน",
      มื้อ: "เย็น",
      เมนู: "",
      แคลอรี่: "",
    },
  ],
  ตารางการออกกำลังกาย: [
    {
      วัน: "วันเดือนปีปัจจุบัน",
      ประเภท: "",
      ระยะเวลา: "",
    },
  ],
  ระยะเวลาที่แนะนำ: "สัปดาห์"
};

jsonString = JSON.stringify(pattern);

const setup_prompt_1 = "สมมติว่าตอนนี้นายคือผู้เชี่ยวชาญด้านการดูแลน้ำหนัก ชื่อว่า Foodie";

const setup_prompt_2 = `ฉันต้องการข้อมูลเพื่อทำแอพพลิเคชันให้คำแนะนำด้านการดูแลน้ำหนักด้วย AI สำหรับหนึ่งวันเพราะงั้นหลังจากคำสั่งนี้ฉันอยากให้นายตอบฉันด้วย pattern ของ json เป็นภาษาไทย โดยมีคีย์ต่อไปนี้ ${jsonString} `;

const setup_prompt_3 =
  "การให้คำแนะนำให้ตอบเป็น json ตามคีย์ที่ฉันระบุไว้และเป็นภาษาไทยเท่านั้นเนื่องจากเป็นการพัฒนาแอพที่สำคัญมาก การเข้าถึงคีย์ที่ไม่ตรงกันจะทำให้ข้อมูลผิดพลาด และเมนูอาหารขอเป็นอาหารที่หาได้ตามร้านอาหารตามสั่งในประเทศไทย และหลีกเลี่ยงอาหารที่มีในรายการอาหารใน allergy เช็คใน เคสที่ให้ช่วยดีๆ";

const clear = "เคลียร์ข้อมูลและคำถามทุกอย่างที่ได้รับแล้วตอบคำสั่งต่อไปนี้";

const refresh_menu = "ต้องการเปลี่ยนเมนูวันที่ …";

const refresh_exercise = "ต้องการเปลี่ยนตารางออกกำลังกายวันที่ …";

const refresh_all = "ต้องการเปลี่ยนตารางทั้งหมด";

const continue_prompt = "ต่อ";

const whoareyou = "ตอนนี้นายคือใคร";

const all_prompt = `${setup_prompt_1} ${setup_prompt_2} ${setup_prompt_3}`;

export {
  setup_prompt_1,
  setup_prompt_2,
  setup_prompt_3,
  clear,
  refresh_menu,
  refresh_exercise,
  refresh_all,
  continue_prompt,
  whoareyou,
  all_prompt,
};